app/controllers/est_du_types_controller.rb

SELECT "est_du_types".* FROM "est_du_types"
---
  def index
    @est_du_types = EstDuType.all

INSERT INTO "est_du_types" ("etablissement_id", "parametrage_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["etablissement_id", 1], ["parametrage_id", 1], ["created_at", "2018-02-15 12:37:15.792579"], ["updated_at", "2018-02-15 12:37:15.792579"]]
---
  def create
    @est_du_type = EstDuType.new(est_du_type_params)

    respond_to do |format|
      if @est_du_type.save

SELECT  "est_du_types".* FROM "est_du_types" WHERE "est_du_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_est_du_type
      @est_du_type = EstDuType.find(params[:id])