app/controllers/etablissements_controller.rb

  def index
    @etablissements = Etablissement.all
---
SELECT "etablissements".* FROM "etablissements"

  def create
    @etablissement = Etablissement.new(etablissement_params)

    respond_to do |format|
      if @etablissement.save
---
INSERT INTO "etablissements" ("nom", "mail", "adresse1", "adresse2", "adresseCp", "adresseVille", "zep", "zoneRural", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_etablissement
      @etablissement = Etablissement.find(params[:id])
---
SELECT  "etablissements".* FROM "etablissements" WHERE "etablissements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]