app/controllers/intervenants_controller.rb

  def index
    @intervenants = Intervenant.all
---
SELECT "intervenants".* FROM "intervenants"

  def create
    @intervenant = Intervenant.new(intervenant_params)

    respond_to do |format|
      if @intervenant.save
---
INSERT INTO "intervenants" ("estResponsablePmis", "pseudo", "mdp", "tel", "nom", "prenom", "mail", "adressePerso1", "adressePerso2", "adressePersoCp", "adressePersoVille", "adressePro1", "adressePro2", "adresseProCp", "adresseProVille", "metier_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_intervenant
      @intervenant = Intervenant.find(params[:id])
---
SELECT  "intervenants".* FROM "intervenants" WHERE "intervenants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]