app/controllers/interventions_controller.rb

SELECT "interventions".* FROM "interventions"
---
  def index
    @interventions = Intervention.all

INSERT INTO "interventions" ("titre", "date", "duree", "description", "nbGarcon", "nbFille", "nbElevesPrevison", "nbElevesPresents", "nbIntAvant", "nbIntApres", "heureDebut", "etablissement_id", "parametrage_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "responsable_etablissements".* FROM "responsable_etablissements" ORDER BY "responsable_etablissements"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def create
    @intervention = Intervention.new(intervention_params)

    respond_to do |format|
      if @intervention.save

        #sends email to responsable_etablissement
        ExampleMailer.sample_email(ResponsableEtablissement.first).deliver

SELECT  "interventions".* FROM "interventions" WHERE "interventions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_intervention
      @intervention = Intervention.find(params[:id])