app/controllers/intervients_controller.rb

  def index
    @intervients = Intervient.all
---
SELECT "intervients".* FROM "intervients"

  def create
    @intervient = Intervient.new(intervient_params)

    respond_to do |format|
      if @intervient.save
---
INSERT INTO "intervients" ("intervenant_id", "intervention_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["intervenant_id", 1], ["intervention_id", 1], ["created_at", "2018-02-15 12:37:25.157554"], ["updated_at", "2018-02-15 12:37:25.157554"]]

    def set_intervient
      @intervient = Intervient.find(params[:id])
---
SELECT  "intervients".* FROM "intervients" WHERE "intervients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]