app/controllers/metiers_controller.rb

SELECT "metiers".* FROM "metiers"
---
  def index
    @metiers = Metier.all

INSERT INTO "metiers" ("label", "specialite", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["label", "Ingenieur"], ["specialite", "agroalimentaire"], ["created_at", "2018-02-15 12:32:41.007418"], ["updated_at", "2018-02-15 12:32:41.007418"]]
---
  def create
    @metier = Metier.new(metier_params)

    respond_to do |format|
      if @metier.save

SELECT  "metiers".* FROM "metiers" WHERE "metiers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_metier
      @metier = Metier.find(params[:id])