app/controllers/parametrages_controller.rb

SELECT "parametrages".* FROM "parametrages"
---
  def index
    @parametrages = Parametrage.all

INSERT INTO "parametrages" ("libelle", "typeParam", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["libelle", "lycée"], ["typeParam", "Etablissement"], ["created_at", "2018-02-15 12:18:20.647629"], ["updated_at", "2018-02-15 12:18:20.647629"]]
---
  def create
    @parametrage = Parametrage.new(parametrage_params)

    respond_to do |format|
      if @parametrage.save

UPDATE "parametrages" SET "typeParam" = ?, "updated_at" = ? WHERE "parametrages"."id" = ?  [["typeParam", "TypeEtablissement"], ["updated_at", "2018-02-15 14:35:43.796512"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @parametrage.update(parametrage_params)

DELETE FROM "parametrages" WHERE "parametrages"."id" = ?  [["id", 2]]
---
  def destroy
    @parametrage.destroy

SELECT  "parametrages".* FROM "parametrages" WHERE "parametrages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_parametrage
      @parametrage = Parametrage.find(params[:id])