app/controllers/responsable_etablissements_controller.rb

  def index
    @responsable_etablissements = ResponsableEtablissement.all
---
SELECT "responsable_etablissements".* FROM "responsable_etablissements"

  def create
    @responsable_etablissement = ResponsableEtablissement.new(responsable_etablissement_params)

    respond_to do |format|
      if @responsable_etablissement.save
---
INSERT INTO "responsable_etablissements" ("pseudo", "mdp", "nom", "prenom", "mail", "fonction", "tel", "etablissement_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_responsable_etablissement
      @responsable_etablissement = ResponsableEtablissement.find(params[:id])
---
SELECT  "etablissements".* FROM "etablissements" WHERE "etablissements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "responsable_etablissements".* FROM "responsable_etablissements" WHERE "responsable_etablissements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]